Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.QueryAnalysisResult Method
 Queries an analysis result.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool QueryAnalysisResult()
Public Function QueryAnalysisResult As Boolean
Return Value
Type: Boolean
True if successfully queried an analysis result.
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace